{
  "!": 0,
  "'": 1,
  "<eos>": 2,
  "<pad>": 3,
  "<sos>": 4,
  "<unk>": 5,
  "_": 6,
  "_آ": 7,
  "_آئی": 8,
  "_آئے": 9,
  "_آب": 10,
  "_آتا": 11,
  "_آتے": 12,
  "_آج": 13,
  "_آخ": 14,
  "_آخر": 15,
  "_آدم": 16,
  "_آش": 17,
  "_آنکھ": 18,
  "_آنکھوں": 19,
  "_آپ": 20,
  "_آگ": 21,
  "_آہ": 22,
  "_آیا": 23,
  "_ا": 24,
  "_اب": 25,
  "_ابھی": 26,
  "_اح": 27,
  "_اس": 28,
  "_اسے": 29,
  "_انت": 30,
  "_اور": 31,
  "_اٹ": 32,
  "_اٹھا": 33,
  "_اپ": 34,
  "_اپنا": 35,
  "_اپنی": 36,
  "_اپنے": 37,
  "_اک": 38,
  "_اگر": 39,
  "_اہل": 40,
  "_ایس": 41,
  "_ایسے": 42,
  "_ایک": 43,
  "_اے": 44,
  "_ب": 45,
  "_با": 46,
  "_بات": 47,
  "_بد": 48,
  "_بر": 49,
  "_بزم": 50,
  "_بس": 51,
  "_بعد": 52,
  "_بن": 53,
  "_بو": 54,
  "_بچ": 55,
  "_بڑ": 56,
  "_بھ": 57,
  "_بھر": 58,
  "_بھی": 59,
  "_بہ": 60,
  "_بہار": 61,
  "_بہت": 62,
  "_بی": 63,
  "_بیٹ": 64,
  "_بے": 65,
  "_ت": 66,
  "_تجھ": 67,
  "_تر": 68,
  "_ترا": 69,
  "_تری": 70,
  "_ترے": 71,
  "_تم": 72,
  "_تمہ": 73,
  "_تمہیں": 74,
  "_تنہا": 75,
  "_تو": 76,
  "_تک": 77,
  "_تھا": 78,
  "_تھی": 79,
  "_تھے": 80,
  "_ج": 81,
  "_جا": 82,
  "_جائیں": 83,
  "_جائے": 84,
  "_جب": 85,
  "_جس": 86,
  "_جسے": 87,
  "_جل": 88,
  "_جن": 89,
  "_جو": 90,
  "_جگر": 91,
  "_جہ": 92,
  "_جہاں": 93,
  "_جی": 94,
  "_جیسے": 95,
  "_ح": 96,
  "_حال": 97,
  "_حس": 98,
  "_حسن": 99,
  "_خ": 100,
  "_خاک": 101,
  "_خبر": 102,
  "_خدا": 103,
  "_خط": 104,
  "_خو": 105,
  "_خود": 106,
  "_خوش": 107,
  "_خیال": 108,
  "_د": 109,
  "_داغ": 110,
  "_در": 111,
  "_درد": 112,
  "_دع": 113,
  "_دل": 114,
  "_دن": 115,
  "_دو": 116,
  "_دوست": 117,
  "_دی": 118,
  "_دیک": 119,
  "_دیکھ": 120,
  "_دیکھتے": 121,
  "_دے": 122,
  "_ذ": 123,
  "_ذرا": 124,
  "_ر": 125,
  "_رخ": 126,
  "_رنگ": 127,
  "_رو": 128,
  "_روز": 129,
  "_رکھ": 130,
  "_رہ": 131,
  "_رہا": 132,
  "_رہی": 133,
  "_رہے": 134,
  "_ز": 135,
  "_زخم": 136,
  "_زلف": 137,
  "_زم": 138,
  "_زند": 139,
  "_زندگی": 140,
  "_س": 141,
  "_سا": 142,
  "_ساتھ": 143,
  "_سب": 144,
  "_ستم": 145,
  "_سخ": 146,
  "_سخن": 147,
  "_سر": 148,
  "_سفر": 149,
  "_سم": 150,
  "_سمجھ": 151,
  "_سن": 152,
  "_سو": 153,
  "_سوچ": 154,
  "_سک": 155,
  "_سہ": 156,
  "_سہی": 157,
  "_سی": 158,
  "_سے": 159,
  "_ش": 160,
  "_شا": 161,
  "_شاید": 162,
  "_شب": 163,
  "_شع": 164,
  "_شمع": 165,
  "_شو": 166,
  "_شوق": 167,
  "_شہر": 168,
  "_ص": 169,
  "_صب": 170,
  "_صبح": 171,
  "_صح": 172,
  "_صورت": 173,
  "_ض": 174,
  "_ط": 175,
  "_طر": 176,
  "_طرح": 177,
  "_طرف": 178,
  "_ظ": 179,
  "_ع": 180,
  "_عا": 181,
  "_عالم": 182,
  "_عج": 183,
  "_عر": 184,
  "_عشق": 185,
  "_عمر": 186,
  "_غ": 187,
  "_غالبؔ": 188,
  "_غم": 189,
  "_غیر": 190,
  "_ف": 191,
  "_فر": 192,
  "_فراق": 193,
  "_ق": 194,
  "_قد": 195,
  "_قدر": 196,
  "_ل": 197,
  "_لب": 198,
  "_لوگ": 199,
  "_لگ": 200,
  "_لیکن": 201,
  "_لیے": 202,
  "_م": 203,
  "_مجھ": 204,
  "_مح": 205,
  "_محبت": 206,
  "_مد": 207,
  "_مر": 208,
  "_مس": 209,
  "_مع": 210,
  "_مق": 211,
  "_مل": 212,
  "_ملتا": 213,
  "_من": 214,
  "_منزل": 215,
  "_مو": 216,
  "_موج": 217,
  "_مگر": 218,
  "_مہ": 219,
  "_میرا": 220,
  "_میری": 221,
  "_میرے": 222,
  "_میں": 223,
  "_مے": 224,
  "_ن": 225,
  "_ناز": 226,
  "_نش": 227,
  "_نظ": 228,
  "_نظر": 229,
  "_نق": 230,
  "_نم": 231,
  "_نکلا": 232,
  "_نگاہ": 233,
  "_نہ": 234,
  "_نہیں": 235,
  "_و": 236,
  "_وح": 237,
  "_وفا": 238,
  "_وقت": 239,
  "_وہ": 240,
  "_وہی": 241,
  "_ٹ": 242,
  "_ٹھ": 243,
  "_پ": 244,
  "_پا": 245,
  "_پر": 246,
  "_پو": 247,
  "_پوچھ": 248,
  "_پڑ": 249,
  "_پھر": 250,
  "_پہ": 251,
  "_پہلے": 252,
  "_پی": 253,
  "_چ": 254,
  "_چار": 255,
  "_چاند": 256,
  "_چاہ": 257,
  "_چرا": 258,
  "_چراغ": 259,
  "_چشم": 260,
  "_چل": 261,
  "_چلے": 262,
  "_چمن": 263,
  "_چھوڑ": 264,
  "_چی": 265,
  "_ڈ": 266,
  "_ک": 267,
  "_کا": 268,
  "_کب": 269,
  "_کبھی": 270,
  "_کت": 271,
  "_کر": 272,
  "_کرتے": 273,
  "_کرو": 274,
  "_کس": 275,
  "_کسی": 276,
  "_کل": 277,
  "_کم": 278,
  "_کو": 279,
  "_کوئی": 280,
  "_کون": 281,
  "_کچھ": 282,
  "_کھل": 283,
  "_کہ": 284,
  "_کہاں": 285,
  "_کہتے": 286,
  "_کہہ": 287,
  "_کہیں": 288,
  "_کی": 289,
  "_کیسے": 290,
  "_کیوں": 291,
  "_کے": 292,
  "_گ": 293,
  "_گئی": 294,
  "_گئے": 295,
  "_گا": 296,
  "_گرد": 297,
  "_گز": 298,
  "_گزر": 299,
  "_گل": 300,
  "_گو": 301,
  "_گھ": 302,
  "_گھر": 303,
  "_گیا": 304,
  "_گے": 305,
  "_ہ": 306,
  "_ہائے": 307,
  "_ہات": 308,
  "_ہاتھ": 309,
  "_ہج": 310,
  "_ہجر": 311,
  "_ہر": 312,
  "_ہم": 313,
  "_ہمیں": 314,
  "_ہن": 315,
  "_ہو": 316,
  "_ہوئی": 317,
  "_ہوئے": 318,
  "_ہوا": 319,
  "_ہوتا": 320,
  "_ہوتی": 321,
  "_ہوتے": 322,
  "_ہوگا": 323,
  "_ہی": 324,
  "_ہیں": 325,
  "_ہے": 326,
  "_ی": 327,
  "_یوں": 328,
  "_یہ": 329,
  "_یہاں": 330,
  "_یہی": 331,
  "،": 332,
  "ؔ": 333,
  "؟": 334,
  "ء": 335,
  "آ": 336,
  "أ": 337,
  "ؤ": 338,
  "ؤں": 339,
  "ئ": 340,
  "ئی": 341,
  "ئے": 342,
  "ا": 343,
  "ائے": 344,
  "اب": 345,
  "ات": 346,
  "اد": 347,
  "ار": 348,
  "ال": 349,
  "الم": 350,
  "ام": 351,
  "ان": 352,
  "اک": 353,
  "اں": 354,
  "اہ": 355,
  "ب": 356,
  "بؔ": 357,
  "بار": 358,
  "باں": 359,
  "بت": 360,
  "بر": 361,
  "بو": 362,
  "بی": 363,
  "ت": 364,
  "تا": 365,
  "تی": 366,
  "تے": 367,
  "ث": 368,
  "ثر": 369,
  "ج": 370,
  "جا": 371,
  "جھ": 372,
  "ح": 373,
  "حر": 374,
  "خ": 375,
  "خت": 376,
  "خم": 377,
  "د": 378,
  "دا": 379,
  "دم": 380,
  "دہ": 381,
  "ذ": 382,
  "ر": 383,
  "را": 384,
  "رت": 385,
  "رم": 386,
  "ری": 387,
  "رے": 388,
  "ز": 389,
  "زا": 390,
  "زار": 391,
  "زل": 392,
  "زم": 393,
  "زو": 394,
  "زہ": 395,
  "زی": 396,
  "س": 397,
  "سا": 398,
  "ست": 399,
  "ستہ": 400,
  "سم": 401,
  "سی": 402,
  "ش": 403,
  "شا": 404,
  "شت": 405,
  "شق": 406,
  "شم": 407,
  "شن": 408,
  "شک": 409,
  "شی": 410,
  "ص": 411,
  "صل": 412,
  "ض": 413,
  "ضا": 414,
  "ط": 415,
  "طر": 416,
  "ظ": 417,
  "ع": 418,
  "عت": 419,
  "عد": 420,
  "غ": 421,
  "ف": 422,
  "فا": 423,
  "فت": 424,
  "فر": 425,
  "فس": 426,
  "فل": 427,
  "ق": 428,
  "قت": 429,
  "قی": 430,
  "ل": 431,
  "لا": 432,
  "لب": 433,
  "لم": 434,
  "لو": 435,
  "لک": 436,
  "لہ": 437,
  "لی": 438,
  "لے": 439,
  "م": 440,
  "مر": 441,
  "من": 442,
  "ن": 443,
  "نا": 444,
  "نج": 445,
  "ند": 446,
  "نم": 447,
  "نوں": 448,
  "نچ": 449,
  "نڈ": 450,
  "نک": 451,
  "نگ": 452,
  "نہ": 453,
  "نہا": 454,
  "نی": 455,
  "نے": 456,
  "و": 457,
  "وا": 458,
  "واز": 459,
  "ود": 460,
  "ور": 461,
  "وس": 462,
  "وم": 463,
  "وں": 464,
  "وے": 465,
  "ً": 466,
  "ٔ": 467,
  "ٰ": 468,
  "ٹ": 469,
  "ٹا": 470,
  "پ": 471,
  "پا": 472,
  "چ": 473,
  "چھ": 474,
  "ڈ": 475,
  "ڑ": 476,
  "ڑا": 477,
  "ژ": 478,
  "ک": 479,
  "کا": 480,
  "کر": 481,
  "کھ": 482,
  "گ": 483,
  "گا": 484,
  "گر": 485,
  "گی": 486,
  "ں": 487,
  "ھ": 488,
  "ھا": 489,
  "ھر": 490,
  "ھو": 491,
  "ھول": 492,
  "ھی": 493,
  "ھے": 494,
  "ہ": 495,
  "ہر": 496,
  "ۂ": 497,
  "ۃ": 498,
  "ی": 499,
  "یا": 500,
  "یب": 501,
  "یت": 502,
  "ید": 503,
  "یر": 504,
  "یس": 505,
  "یش": 506,
  "یک": 507,
  "یں": 508,
  "یے": 509,
  "ے": 510,
  "ۓ": 511
}