{
  "!": 0,
  "'": 1,
  "'_": 2,
  "'asa": 3,
  "'asad": 4,
  "'asad'_": 5,
  "'ghali": 6,
  "'ghalib'_": 7,
  ",": 8,
  "-": 9,
  "-e-": 10,
  "-e-a": 11,
  "-o-": 12,
  "<eos>": 13,
  "<pad>": 14,
  "<sos>": 15,
  "<unk>": 16,
  "?": 17,
  "_": 18,
  "a": 19,
  "a_": 20,
  "aa": 21,
  "aad": 22,
  "aadmi_": 23,
  "aae_": 24,
  "aage_": 25,
  "aaj_": 26,
  "aalam_": 27,
  "aankh_": 28,
  "aap_": 29,
  "aata_": 30,
  "aate_": 31,
  "aati_": 32,
  "aaya_": 33,
  "ab": 34,
  "ab_": 35,
  "ach": 36,
  "achch": 37,
  "ada_": 38,
  "af": 39,
  "agar_": 40,
  "ah": 41,
  "ahl-e-": 42,
  "ai_": 43,
  "aisa_": 44,
  "aise_": 45,
  "aisi_": 46,
  "ak": 47,
  "an": 48,
  "anda": 49,
  "ankhen_": 50,
  "ankhon_": 51,
  "ap": 52,
  "apna_": 53,
  "apne_": 54,
  "apni_": 55,
  "ar": 56,
  "ar_": 57,
  "as": 58,
  "ash": 59,
  "asman_": 60,
  "aur_": 61,
  "az": 62,
  "b": 63,
  "b'_": 64,
  "b-e-": 65,
  "b_": 66,
  "ba": 67,
  "ba-": 68,
  "baad_": 69,
  "baaqi_": 70,
  "baat_": 71,
  "bad": 72,
  "bahut_": 73,
  "baithe_": 74,
  "bat_": 75,
  "baten_": 76,
  "baz": 77,
  "be": 78,
  "be-": 79,
  "bha": 80,
  "bhi_": 81,
  "bhu": 82,
  "bi": 83,
  "bo": 84,
  "bu": 85,
  "buj": 86,
  "c": 87,
  "ch": 88,
  "chahiye_": 89,
  "chal_": 90,
  "chale_": 91,
  "chaman_": 92,
  "chand_": 93,
  "chash": 94,
  "chashm-e-": 95,
  "cheh": 96,
  "chh": 97,
  "chh_": 98,
  "chho": 99,
  "chhod_": 100,
  "chhu": 101,
  "d": 102,
  "d-": 103,
  "d-e-": 104,
  "d_": 105,
  "da": 106,
  "da-e-": 107,
  "dagi_": 108,
  "dam_": 109,
  "dard_": 110,
  "dariya_": 111,
  "das": 112,
  "dat_": 113,
  "de": 114,
  "dekh": 115,
  "dekh_": 116,
  "dekhte_": 117,
  "dh": 118,
  "dhar_": 119,
  "dhu": 120,
  "di": 121,
  "dil": 122,
  "dil-": 123,
  "dil-e-": 124,
  "dil_": 125,
  "diya_": 126,
  "do": 127,
  "dost_": 128,
  "du": 129,
  "duni": 130,
  "duniya_": 131,
  "dush": 132,
  "duur_": 133,
  "e": 134,
  "e-": 135,
  "e_": 136,
  "ega_": 137,
  "egi_": 138,
  "eh": 139,
  "ek_": 140,
  "en_": 141,
  "enge_": 142,
  "er": 143,
  "f": 144,
  "f-e-": 145,
  "f_": 146,
  "fa": 147,
  "fat_": 148,
  "fi": 149,
  "fu": 150,
  "fur": 151,
  "g": 152,
  "g_": 153,
  "ga": 154,
  "gae_": 155,
  "gah-e-": 156,
  "gaya_": 157,
  "ge_": 158,
  "gh": 159,
  "gh-e-": 160,
  "gha": 161,
  "ghair_": 162,
  "ghali": 163,
  "gham-e-": 164,
  "gi": 165,
  "gi_": 166,
  "go": 167,
  "gu": 168,
  "gul_": 169,
  "guz": 170,
  "guzar_": 171,
  "h": 172,
  "h_": 173,
  "ha": 174,
  "ha-e-": 175,
  "haal_": 176,
  "haath_": 177,
  "hai_": 178,
  "hain_": 179,
  "ham": 180,
  "ham-": 181,
  "ham_": 182,
  "hamen_": 183,
  "has": 184,
  "hasti_": 185,
  "hava_": 186,
  "he_": 187,
  "hen_": 188,
  "hi": 189,
  "hi_": 190,
  "hij": 191,
  "hijr_": 192,
  "ho": 193,
  "ho_": 194,
  "hoga_": 195,
  "hota_": 196,
  "hote_": 197,
  "hoti_": 198,
  "hu": 199,
  "hua_": 200,
  "hue_": 201,
  "hui_": 202,
  "hus": 203,
  "husn_": 204,
  "huun_": 205,
  "i": 206,
  "i_": 207,
  "id_": 208,
  "iin_": 209,
  "ik_": 210,
  "il": 211,
  "in": 212,
  "in_": 213,
  "inti": 214,
  "ir": 215,
  "is": 216,
  "ishq_": 217,
  "it": 218,
  "itna_": 219,
  "iz": 220,
  "iz_": 221,
  "j": 222,
  "j-e-": 223,
  "j_": 224,
  "ja": 225,
  "jaae_": 226,
  "jaaen_": 227,
  "jaata_": 228,
  "jaate_": 229,
  "jaati_": 230,
  "jal": 231,
  "je_": 232,
  "ji": 233,
  "jigar_": 234,
  "jiye_": 235,
  "jo": 236,
  "jo_": 237,
  "ju": 238,
  "k": 239,
  "k-": 240,
  "k-e-": 241,
  "k_": 242,
  "ka": 243,
  "ka_": 244,
  "kaam_": 245,
  "kahte_": 246,
  "kal_": 247,
  "kam_": 248,
  "kare_": 249,
  "karte_": 250,
  "kaun_": 251,
  "ke_": 252,
  "kh": 253,
  "khaya": 254,
  "khayal_": 255,
  "khe": 256,
  "khud_": 257,
  "khuda_": 258,
  "khvab_": 259,
  "ki": 260,
  "ki_": 261,
  "kiya_": 262,
  "kiye_": 263,
  "ko": 264,
  "ko_": 265,
  "koi_": 266,
  "kr_": 267,
  "ku": 268,
  "kuchh_": 269,
  "kuun_": 270,
  "kya_": 271,
  "kyuun_": 272,
  "l": 273,
  "l-": 274,
  "l-e-": 275,
  "l_": 276,
  "la": 277,
  "lag": 278,
  "lagta_": 279,
  "lahu_": 280,
  "lam_": 281,
  "lat_": 282,
  "le": 283,
  "le_": 284,
  "lekin_": 285,
  "li": 286,
  "liya_": 287,
  "liye_": 288,
  "lo": 289,
  "log_": 290,
  "lte_": 291,
  "lu": 292,
  "m": 293,
  "m-": 294,
  "m-e-": 295,
  "m_": 296,
  "ma": 297,
  "magar_": 298,
  "mai": 299,
  "mai-": 300,
  "main_": 301,
  "maj": 302,
  "mal_": 303,
  "man_": 304,
  "manzi": 305,
  "mat_": 306,
  "mau": 307,
  "meh": 308,
  "men_": 309,
  "mer": 310,
  "mere_": 311,
  "meri_": 312,
  "mi": 313,
  "mil": 314,
  "milta_": 315,
  "mire_": 316,
  "miri_": 317,
  "mo": 318,
  "moh": 319,
  "mohab": 320,
  "mohabbat_": 321,
  "mu": 322,
  "mud": 323,
  "muj": 324,
  "mujh_": 325,
  "mujhe_": 326,
  "munh_": 327,
  "mush": 328,
  "n": 329,
  "n_": 330,
  "na": 331,
  "na-": 332,
  "na_": 333,
  "naam_": 334,
  "nahin_": 335,
  "nam_": 336,
  "naq": 337,
  "naz": 338,
  "nazar_": 339,
  "ne_": 340,
  "ng": 341,
  "nge_": 342,
  "ni": 343,
  "nigah-e-": 344,
  "nigah_": 345,
  "nik": 346,
  "nikla_": 347,
  "nikle_": 348,
  "nu": 349,
  "o": 350,
  "o-": 351,
  "o_": 352,
  "on_": 353,
  "p": 354,
  "p_": 355,
  "pa": 356,
  "pahle_": 357,
  "pai": 358,
  "pe": 359,
  "pe_": 360,
  "ph": 361,
  "phir_": 362,
  "phuul_": 363,
  "pi": 364,
  "pu": 365,
  "puchh_": 366,
  "pyaar_": 367,
  "q": 368,
  "q-e-": 369,
  "q_": 370,
  "qa": 371,
  "qad": 372,
  "qadam_": 373,
  "qat": 374,
  "qat_": 375,
  "qaya": 376,
  "qayamat_": 377,
  "qi": 378,
  "qi_": 379,
  "qu": 380,
  "r": 381,
  "r-": 382,
  "r-e-": 383,
  "r_": 384,
  "ra": 385,
  "raat_": 386,
  "ras": 387,
  "rat-e-": 388,
  "rat_": 389,
  "rau": 390,
  "re": 391,
  "re_": 392,
  "ri": 393,
  "ri_": 394,
  "ro": 395,
  "ru": 396,
  "ru_": 397,
  "s": 398,
  "s_": 399,
  "sa": 400,
  "saath_": 401,
  "sada_": 402,
  "sak": 403,
  "sam": 404,
  "samaj": 405,
  "samj": 406,
  "sat_": 407,
  "sau": 408,
  "se_": 409,
  "sh": 410,
  "sh-e-": 411,
  "shaam_": 412,
  "shahr_": 413,
  "shau": 414,
  "shauq_": 415,
  "shayad_": 416,
  "si": 417,
  "sitam_": 418,
  "siva_": 419,
  "so": 420,
  "st_": 421,
  "su": 422,
  "sub": 423,
  "subh_": 424,
  "sukhan_": 425,
  "surat_": 426,
  "suun_": 427,
  "t": 428,
  "t-": 429,
  "t-e-": 430,
  "t_": 431,
  "ta": 432,
  "ta-": 433,
  "tak_": 434,
  "tama": 435,
  "tamam_": 436,
  "te": 437,
  "te_": 438,
  "ten_": 439,
  "ter": 440,
  "teri_": 441,
  "th_": 442,
  "tha_": 443,
  "the_": 444,
  "thi_": 445,
  "ti": 446,
  "ti_": 447,
  "tire_": 448,
  "tiri_": 449,
  "to": 450,
  "to_": 451,
  "ton_": 452,
  "tu": 453,
  "tu_": 454,
  "tuj": 455,
  "tujh_": 456,
  "tujhe_": 457,
  "tum": 458,
  "tum_": 459,
  "tumhen_": 460,
  "u": 461,
  "ul": 462,
  "ul_": 463,
  "um": 464,
  "umr_": 465,
  "un": 466,
  "un_": 467,
  "ur_": 468,
  "us_": 469,
  "use_": 470,
  "usi_": 471,
  "ut": 472,
  "v": 473,
  "v_": 474,
  "va": 475,
  "va-e-": 476,
  "vaale_": 477,
  "vafa_": 478,
  "vahsha": 479,
  "vaq": 480,
  "vaqt_": 481,
  "varna_": 482,
  "vat_": 483,
  "vaz_": 484,
  "ve_": 485,
  "vo_": 486,
  "w": 487,
  "x": 488,
  "y": 489,
  "ya": 490,
  "ya_": 491,
  "yaad_": 492,
  "yad_": 493,
  "yat_": 494,
  "ye_": 495,
  "yon_": 496,
  "yu": 497,
  "yuun_": 498,
  "z": 499,
  "z-e-": 500,
  "z_": 501,
  "za": 502,
  "zakh": 503,
  "zamana_": 504,
  "zamane_": 505,
  "zamin_": 506,
  "zi": 507,
  "zindagi_": 508,
  "zu": 509,
  "zu_": 510,
  "zul": 511
}